art_share_api/app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "little bobby tables"], ["email", "drop_database@jk.com"], ["created_at", "2019-06-17 22:51:17.546564"], ["updated_at", "2019-06-17 22:51:17.546564"]]
---
  def create
    user = User.create(name:params['name'], email:params['email'])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "bilbo"], ["updated_at", "2019-06-17 22:12:32.122795"], ["id", 11]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)