art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (usermame = NULL)
---
  def index
      users = User.all